<img src="https://github.com/danielscarvalho/data/blob/master/img/FIAP-logo.png?raw=True" style="float:right;" width="200px">

# DATA SCIENCE & STATISTICAL COMPUTING [》](https://www.fiap.com.br/)

## Dataframe & Python

### LAP Parte 1: “10 minutes to pandas"

https://pandas.pydata.org/docs/user_guide/10min.html

Sugestão: Colocar a página do Cookbook lado a lado com este notebook para realizar as operações.

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 0f437949513225922d851e9581723d82120684a6
python           : 3.8.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22621
machine          : AMD64
processor        : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : pt_BR.cp1252

pandas           : 2.0.3
numpy            : 1.24.4
pytz             : 2024.1
dateutil         : 2.9.0.post0
setuptools       : 49.2.1
pip              : 20.2.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : None
IPython          : 8.12.3
pandas_datareader: None
bs4              : None
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.5
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
zstandard        : None
tzdata           : 2024.1
qtpy             : None
pyqt5            : None

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2013-01-01  0.563661 -0.884493 -0.995159  1.890407
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188
2013-01-04  0.590022  0.244871  0.554893  1.428092
2013-01-05  0.234084  0.061372  1.130260 -1.194690
2013-01-06  0.034770 -0.363662 -0.152009  0.507102

In [8]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [30]:
df2.A
df2.B
df2.C
df2.D
df2.E
df2.F

0    foo
1    foo
2    foo
3    foo
Name: F, dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.563661 -0.884493 -0.995159  1.890407
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188
2013-01-04  0.590022  0.244871  0.554893  1.428092
2013-01-05  0.234084  0.061372  1.130260 -1.194690

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.590022  0.244871  0.554893  1.428092
2013-01-05  0.234084  0.061372  1.130260 -1.194690
2013-01-06  0.034770 -0.363662 -0.152009  0.507102

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.to_numpy()

array([[ 0.56366071, -0.88449253, -0.99515916,  1.89040682],
       [-1.52026096,  0.64442125,  0.15593519,  0.96391057],
       [ 0.95849899,  2.09171263, -0.87004687, -0.02418797],
       [ 0.59002206,  0.24487066,  0.55489344,  1.42809153],
       [ 0.2340838 ,  0.06137176,  1.1302598 , -1.19468963],
       [ 0.03477042, -0.36366183, -0.15200943,  0.50710226]])

In [16]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [17]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.143463  0.299037 -0.029355  0.595106
std    0.875016  1.022967  0.821580  1.104746
min   -1.520261 -0.884493 -0.995159 -1.194690
25%    0.084599 -0.257403 -0.690538  0.108635
50%    0.398872  0.153121  0.001963  0.735506
75%    0.583432  0.544534  0.455154  1.312046
max    0.958499  2.091713  1.130260  1.890407

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.563661   -1.520261    0.958499    0.590022    0.234084    0.034770
B   -0.884493    0.644421    2.091713    0.244871    0.061372   -0.363662
C   -0.995159    0.155935   -0.870047    0.554893    1.130260   -0.152009
D    1.890407    0.963911   -0.024188    1.428092   -1.194690    0.507102

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.890407 -0.995159 -0.884493  0.563661
2013-01-02  0.963911  0.155935  0.644421 -1.520261
2013-01-03 -0.024188 -0.870047  2.091713  0.958499
2013-01-04  1.428092  0.554893  0.244871  0.590022
2013-01-05 -1.194690  1.130260  0.061372  0.234084
2013-01-06  0.507102 -0.152009 -0.363662  0.034770

In [21]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01  0.563661 -0.884493 -0.995159  1.890407
2013-01-06  0.034770 -0.363662 -0.152009  0.507102
2013-01-05  0.234084  0.061372  1.130260 -1.194690
2013-01-04  0.590022  0.244871  0.554893  1.428092
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188

In [22]:
df["A"]

2013-01-01    0.563661
2013-01-02   -1.520261
2013-01-03    0.958499
2013-01-04    0.590022
2013-01-05    0.234084
2013-01-06    0.034770
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.563661 -0.884493 -0.995159  1.890407
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188

In [24]:
df[1:-1]

                   A         B         C         D
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188
2013-01-04  0.590022  0.244871  0.554893  1.428092
2013-01-05  0.234084  0.061372  1.130260 -1.194690

In [25]:
df

                   A         B         C         D
2013-01-01  0.563661 -0.884493 -0.995159  1.890407
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188
2013-01-04  0.590022  0.244871  0.554893  1.428092
2013-01-05  0.234084  0.061372  1.130260 -1.194690
2013-01-06  0.034770 -0.363662 -0.152009  0.507102

In [26]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.520261  0.644421  0.155935  0.963911
2013-01-03  0.958499  2.091713 -0.870047 -0.024188
2013-01-04  0.590022  0.244871  0.554893  1.428092